[
  {
    "id": "chronicle-new-website",
    "title": "Porkyville Chronicle Unveils New Website",
    "date": "2025-09-07",
    "author": "staff",
    "category": ["PE", "Culture"],
    "excerpt": "The Empire’s leading newspaper launches a modern online edition — bringing stories from the Overworld, Nether, and End to readers everywhere.",
    "markdown": true,
    "content": "The **Piggian Empire’s national newspaper**, the *Porkyville Chronicle*, has entered a new age of publishing with the launch of its official online edition. For the first time in its storied history, the Chronicle’s pages will no longer be confined to parchment and ink — they will now be accessible from anywhere in the multiverse.\n\n## A Modern Imperial Gazette\n\nThe new website is designed to reflect the Chronicle’s traditional role as the **voice of the Empire**, while embracing the conveniences of modern technology. Visitors will find:\n\n- **Front page top stories** highlighting the most pressing events in Porkyville and beyond.\n- **Category sections** dedicated to *Piggian Empire*, *World*, *Politics*, *Economy*, and *Culture*.\n- A **searchable archive** of past stories, allowing readers to trace events back through time.\n- **Illustrations and documents** embedded directly in articles, bringing context to every report.\n\n![Front page screenshot](assets/images/frontpage-sample.png)\n\n## Reaching Across the Realms\n\nKaiser Live-van der Big praised the launch in an official statement, noting that *“an informed citizenry is the lifeblood of the Empire. With this new platform, the Chronicle ensures that every villager, from the western potato fields to the far edges of the Nether, has access to truth and knowledge.”*\n\nThe website also represents a new era of **international journalism**. With stories from the World Assembly, trade updates from faraway markets, and cultural features from across the multiverse, the Chronicle aims to broaden its scope while maintaining its imperial roots.\n\n## Tradition Meets Innovation\n\nWhile the Chronicle now appears in a digital form, it retains the stylistic elements of the imperial gazette: a bold masthead, drop caps at the beginning of articles, and sections demarcated with deep red rules. Readers can expect the same **editorial standards** that have defined the paper since its founding.\n\n> *“The Chronicle is no longer just a newspaper; it is a public forum, a record of history, and a stage upon which the Empire presents itself to the world.”* — Editorial Board\n\n---\n\n### Join Us Online\nReaders can now visit the Chronicle daily at **chronicle.porkify.net** to stay informed. As the Piggian Empire grows in influence, so too does the responsibility of its journalists to provide honest, timely, and engaging reporting.\n\nThis is only the beginning of the Chronicle’s digital journey — and the newsroom is already hard at work preparing the next wave of stories.\n"
  },
  {
    "id": "end-war-monkey-kingdom",
    "title": "Monkey Kingdom Triumphs in Monkey-Kyaran War, Reports of Extortions",
    "date": "2025-09-08",
    "author": "staff",
    "category": ["World"],
    "excerpt": "The Monkey Kingdom and Kako Tsuki overwhelmed a fortified coalition in the End, raising fresh questions about war crimes and reparations.",
    "markdown": true,
    "content": "In one of the most brutal clashes the world has seen in recent memory, the **Monkey Kingdom**, allied with **Kako Tsuki**, secured a decisive victory over a coalition of the **Piggian Empire**, the **Kingdom of Kyara**, the **Kingdom of Ravenhold**, and **MIHOEN**. The battle, fought entirely on the **main island of the End dimension**, lasted a mere ninety minutes but left a deep mark on all participants.\n\n## Fortifications Overrun\n\nCoalition forces had prepared heavy fortifications across the central End island, determined to resist the attackers. Despite their defenses, they were unprepared for the **Monkey Kingdom’s deployment of Maces** — devastating weapons capable of delivering lethal blows even through fully enchanted Netherite armor. This technological and tactical edge quickly tipped the balance of battle.\n\nEyewitnesses described scenes of chaos as fortified lines buckled and defensive formations collapsed.\n\n## The First Casualty: A Reporter\n\nThe first life lost in the conflict was not a soldier but a **news reporter**, raising immediate concerns of **possible war crimes**. The Administration quickly launched an investigation into the circumstances of the journalist’s death, but it was quickly found that the news reporter had positioned themselves on the dangerous frontline, which lead to their untimely demise.\n\n## Treaty and Reparations\n\nFollowing the overwhelming defeat, peace was swiftly negotiated. However, the end of hostilities has not brought stability. Delegates of the Monkey Kingdom have reportedly traveled to **The Dominion** and the **Kingdom of Ravenhold** demanding **reparations** for the cost of war, with thinly veiled threats of renewed hostilities if their demands are not met.\n\nDiplomatic sources warn that these aggressive demands could fracture the fragile peace and spark **a new wave of conflict** across the realms.\n\n## A Fragile Peace\n\nWhile the Monkey Kingdom celebrates victory, the rest of the world watches uneasily. The short war has exposed the devastating potential of new weaponry, the vulnerability of even the strongest fortifications, and the perilous state of international diplomacy.\n\n> *“The war lasted only an hour and a half,”* an exhausted Piggian commander told the Chronicle, *“but the consequences may last for years.”*\n"
  },
  {
  "id": "piggian-recession-loans",
  "title": "Loans to Kyara Push Piggian Empire Into Recession",
  "date": "2025-09-08",
  "author": "staff",
  "category": ["PE", "Economy"],
  "excerpt": "Generous wartime loans, vanishing reserves, and the closure of the Boarstone Exchange spark a sharp downturn in the Piggian economy.",
  "markdown": true,
  "content": "The Piggian Empire, fresh from its defeat in the **End War**, has now been rocked by a deepening **economic recession**. Officials confirmed that a wave of loans extended to the **Kingdom of Kyara**, intended to help the close ally build up their army for the conflict, has left the imperial treasury strained.\n\n## Vanishing Reserves\n\nThe crisis worsened when the government quietly **relocated the Empire’s gold and emerald reserves to an undisclosed location**. While no explanation was given, speculation ranges from fears of foreign seizure to internal instability. The move has rattled investor confidence and fueled rumors of a looming currency crisis.\n\n## The Boarstone Exchange Shuts Down\n\nIn another shock, all **physical branches of the Boarstone Exchange** — the Empire’s primary financial hub — were forcibly closed by government order. Markets across the mainland ground to a halt overnight, with only limited over-the-counter trading continuing in secret.\n\nMerchants and citizens alike have been left in disarray. *“I had my savings locked away in Boarstone bonds,”* one Porkyville shopkeeper told the Chronicle. *“Now I can’t even redeem them. What am I supposed to pay my workers with?”*\n\n## Economic Outlook\n\nEconomists warn that the combination of **unsustainable loans**, **vanishing reserves**, and the **paralysis of financial institutions** could mark the beginning of a prolonged downturn. Potato prices have already risen sharply in the western fields, while beef exports from the Empire have slowed due to shaken trade partners.\n\n## Political Ramifications\n\nOpposition voices within the Assembly are calling for an inquiry into the government’s handling of the crisis. Some accuse the Emperor’s ministers of **recklessly mortgaging the Empire’s stability** to maintain foreign alliances. Others argue that **supporting Kyara was necessary** to keep the Monkey Kingdom’s influence in check.\n\nAs uncertainty grows, the Empire’s citizens are left to wonder how long the recession will last — and whether the once mighty Piggian economy can recover its strength.\n"
  },
  {
    "id": "porkingsberg-investment-plots",
    "title": "Pörkingsberg Opens Land to Foreign Investors",
    "date": "2025-09-10",
    "author": "staff",
    "category": ["PE", "Economy"],
    "excerpt": "City officials announce new land plots for sale to foreign investors and builders, aiming to accelerate development in the imperial capital.",
    "markdown": true,
    "content": "![A plot of Pörkingsberg land for sale](assets/images/porkingsberg.png)\nIn a move aimed at revitalizing its urban landscape, the city of **Pörkingsberg** has officially opened **plots of land to foreign investors and builders**. Local authorities framed the initiative as a bold step to attract capital, expertise, and fresh ideas into the Empire’s historic capital.\n\n## Boosting Development\n\nThe announcement comes amid a broader effort by the Piggian government to **stimulate economic growth** and diversify the city’s infrastructure. By opening Pörkingsberg’s districts to outside funding, officials hope to accelerate the construction of new housing, commercial centers, and public works.\n\n> *“This is an opportunity for international partners to become part of our city’s story,”* said Deputy Mayor Anselm von Schwein. *“We want to see Pörkingsberg grow into a hub that reflects both our traditions and our openness to the world.”*\n\n## Opportunities and Concerns\n\nForeign builders will be able to bid for **long-term leases** on designated plots, with priority given to projects that align with the city’s development goals — including sustainable housing, cultural venues, and expanded marketplaces.\n\nHowever, some local voices have expressed concern. Critics worry that foreign investment could push up land values and make housing unaffordable for Pörkingsberg’s residents. Others fear that foreign architectural styles could overshadow the city’s imperial heritage.\n\n---\n\n### A City at a Crossroads\nWhether this gamble pays off will depend on careful regulation and continued cooperation between local leaders and their new foreign partners. For now, Pörkingsberg’s skyline is set to change — and the world is watching.\n"
  },
  {
    "id": "chronicle-opens-to-foreign-contributors",
    "title": "Chronicle Opens Submissions to Foreign Contributors",
    "date": "2025-09-11",
    "author": "staff",
    "category": ["World", "Culture"],
    "excerpt": "The Porkyville Chronicle will now publish stories from writers and reporters across the multiverse. Interested contributors are invited to make contact for details.",
    "markdown": true,
    "content": "The **Porkyville Chronicle** is proud to announce that it is opening its pages to **foreign contributors**. Writers, reporters, and commentators from nations across the multiverse will now have the opportunity to publish their stories alongside the Chronicle’s own staff coverage.\n\n## A Broader Perspective\n\nWhile the Chronicle has long been the official newspaper of the **Piggian Empire**, demand for more diverse coverage has grown in recent months. So far, the **Kingdom of Ravenhold** has already showed interest in posting articles in the Porkyville Chronicle.\n\nDeputy Editor Brünn Schwein explained the shift: *“The world is interconnected. Decisions made in one nation can ripple across the multiverse. By welcoming stories from outside the Empire, we aim to give readers a richer, fuller understanding of global affairs.”*\n\n## How It Works\n\nForeign contributors may submit articles, reports, or opinion pieces to the Chronicle’s editorial team. Submissions will be reviewed for style, clarity, and adherence to the Chronicle’s editorial standards before publication.\n\nInterested parties are encouraged to **contact the Chronicle directly** for further information on how to submit their work. (In practice: please reach out to PorkyLIVE on Discord or [E-Mail us](mailto:porky@porky.live?subject=I%20have%20a%20story%20for%20the%20Porkyville%20Chronicle).)\n\n## Strengthening Dialogue\n\nThe Chronicle’s leadership views this initiative as a step toward building stronger ties between nations. By publishing stories written by foreign citizens, the newspaper hopes to foster dialogue, cultural exchange, and a better understanding of shared challenges.\n\n---\n\n### A Multiverse of Voices\nThe Chronicle invites all who have a story to tell — whether a report from the battlefield, a cultural feature, or a political commentary — to take part in this new chapter of journalism. The pages of the Empire’s newspaper are open wider than ever before.\n"
  },
  {
    "id": "ravenhold-first-triumph",
    "title": "Ravenhold Secures First Victory on Ravenhold Border",
    "date": "2025-09-11",
    "author": "ravenhold",
    "category": ["World"],
    "excerpt": "The young kingdom of Ravenhold has claimed its first triumph, forcing an unknown faction of settlers to withdraw after a tense standoff on its northern border. Diplomacy and resolve averted a wider war, with King Lampros declaring the action necessary for national security.",
    "markdown": true,
    "content": "In the late hours of the 10th of September 2025, A group of numerous settlers attempted to establish a nation on the border of the Kingdom of Ravenhold. This article will cover the events that transpired on this intense day for national politics.\n\nFor the first time in its young but highly ambitious history, the Kingdom of Ravenhold has emerged victorious in a conflict with a rival power. Securing a decisive victory in a skirmish with an unknown power wishing to set up on the border of Ravenhold. A news reporter stated, *“All-out war seemed all but guaranteed, however the unknown settlers chose to back down at the final moment.”* \n\n### The situation of the war\n![Overview of the war](assets/images/ravenhold-first-triumph.png)\nThe map shown above shows the intended settlement location of the unknown faction (in blue) with Ravenhold being shown at the bottom (in red).\n\nThe leadership of Ravenhold expressed concern over the new faction to the north as soon as they were informed of the situation. The situation escalated when the unknown faction refused to back down or submit, leaving war as the final option, although hesitant, Ravenhold leadership was not afraid to back down from a fight that determined national security. A statement from King Lampros states *“We exhausted all options of diplomacy and my hand was forced, therefore I must declare war for the preserved safety of my country and people”*.\n\nSources have yet to determine the exact intentions of the late faction to the north of Ravenhold, but Ravenhold leadership insists to the international community that this was an act of self-defence, and that Ravenhold holds no hostile tendencies to the rest of the world as stated by Lord Gambit in a recent interview.\n\n### Summary of the situation\nThe war seems to be averted as the unknown faction has backed down and left the area surrounding Ravenhold, with most of ravenhold returning to its daily life, this situation seems to have been averted thanks to the skilled diplomats of the Kingdom of Ravenhold.\n"
  },
  {
    "id": "ravenhold-warden-sighting",
    "title": "Warden Sightings Across Ravenhold Empire",
    "date": "2025-09-13",
    "author": "ravenhold",
    "category": ["World"],
    "excerpt": "Strange noises in Ravenhold’s newly annexed snow territories led scouts to uncover a skulk-infested igloo — and two deadly Warden encounters. Emperor Lampros and his champions struck down the threat, but questions remain whether the incident was a freak occurrence or something more sinister.",
    "markdown": true,
    "content": "Early this morning, a scout party was out hunting for food in the outskirts of Ravenhold, however this was no routine hunting activity, the scout party heard strange noises coming from the nearby snow territories newly annexed by the Ravenhold Empire.\n\nThey reported their findings to the provincial administration and were given orders to investigate, very quickly it was found that there was skulk, covering an igloo and the surrounding area. The scout party asked what the administration's next move would be, so the administration passed this issue directly to the emperor as a concern for internal safety of the nation. Here is a photo of the scene caught by the scouting party:\n\n![Sighting of the Warden](/assets/images/WardenSighting.png)\n\nLater that morning, the best that Emperor Lampros could muster, including himself encroached on the Wardens lair, during investigation a Warden emerged from the ground and devoured 2 of the soldiers, just as a second Warden emerged and gave chase to the champion of Ravenhold, Zeno, who lead the second Warden away before quickly returning to strike down the first warden with Emperor Lampros. The second warden having seemingly escaped, the squad was ordered by the emperor to clean up the skulk and donate all skulk related items to MIHOEN, the general defence contractor for the kingdom of Ravenhold.\n\nLater that evening the second Warden was found by a routine patrol squad and quickly neutralised with no casualties. But the real question is, was this a freak accident? Or was this premeditated by another nation...\n"
  }
]
